inherit "/std/skill/dodge";

void create() {
    name = "梯雲縱";

    actions = ({
        "$n使出『"HIC"天"HIW"人"HIM"合"HIY"一"NOR"』，一個蹬步便凌空而起，輕易地閃過$N的攻擊。\n",
        "只見$n身影一轉，整個人反鑽進$N的攻擊範圍內，一式『"HIW"圓"HIC"轉"HIM"太"HIY"極"NOR"』險險避過$N的攻勢。\n",
        "$n左足一點，在空中一轉一折，一招『"HIY"梯雲縱"NOR"』之『"HIM"行"HIW"雲"HIG"流"HIC"水"NOR"』騰空而起，避了開去。\n",
        "只見$n使出『"HIC"宛"HIY"在"HIW"風"HIM"中"NOR"』，身子彷若無骨，隨著$N的攻擊罡風輕輕盪開。\n",
        "$n身影微動，雙腳連踩飛昇，一式『"HIC"登"HIW"天"HIM"門"NOR"』瀟灑地高躍過$N頭頂。\n",
        "但是$n一招『"HIM"騰"HIW"雲"HIC"駕"HIY"霧"NOR"』使出，人早已踏著$N的攻擊罡風高躍閃過！\n",
        "但$n覷轉$N的空隙，一招『"HIM"星"HIC"隨"HIW"雲"HIG"轉"NOR"』後發先至反攻向$N要害，逼得$N縮招自保。\n",
        "只見$n身形微動，小跳而起，一式『"HIM"萬"HIW"里"HIC"無"HIY"雲"NOR"』在空中迴旋數下，輕輕巧巧地落到$N的左側。\n",
        "$n凌空飛起，使出一招『"HIW"雲"HIG"淡"HIC"風"HIM"清"NOR"』，擰身一折，身子硬生生在空中平平飄開，$N招式未到，$n早已飄落三尺開外之處。\n",
        "$n使出『"HIY"梯雲縱"NOR"』之絕詣『"HIM"移"HIC"雲"HIY"換"HIW"形"NOR"』，身形如鶴，隨風不停幻化方位，瀟灑地避過$N的招式。\n",
        "$n一聲長笑後突然倒翻前衝，一式『"HIC"雲"HIM"譎"HIY"波"HIG"詭"NOR"』硬生生反進為退，瞬間與$N錯身而過，接連幾下跳躍後，便將$N拋至丈餘後。\n",
        "$n一個鐵板橋使$N攻擊落空，跟著一招『"NOR"煙"HIW"消"HIC"雲"NOR + CYN"散"NOR"』翻身而起，雙腳藉$N肩膊凌踏高躍，空中幾個翻騰過後，便出了重圍之外。\n",
        "$n一提氣，全力展開身法，『"HIC"雲"NOR"煙"CYN"過"HIG"眼"NOR"』幻出的無數身影看得$N眼花撩亂，無從下手。\n",
    });
}
