inherit "/std/skill/dodge";

void create() {
    name = "火蝠身法";

    actions = ({
        "但是$n身形飄忽，輕輕一縱，一招「"HIY"扶搖直上"NOR"」早已避開。\n",
        "$n身隨意轉一式「"HIY"火蝠翻身"NOR"」，倏地往一旁挪開了三尺，避過了這一招。\n",
        "可是$n側身一讓，一式「"HIG"蝠氣逼人"NOR"」$N這一招撲了個空。\n",
        "卻見$n足不點地，「"HIC"蝠不落地"NOR"」往旁竄開數尺，躲了開去。\n",
        "$n身形微晃，「"HIM"蝠星高照"NOR"」有驚無險地避開了$N這一招。\n"
        "只見$n轉了幾轉，身影愈見飄忽，一式『火煙裊裊』輕鬆避開$N這一擊。\n",
        "$n身隨意轉，步走斜曲，一式『火光疾疾』瞬間與$N擦身而過。\n",
        "可是$n速度突然加快，側身一讓，殘影排擺而出，一式『蝠影幢幢』讓$N撲了個空。\n",
        "$n冷笑一聲，只見青袍四處翻飛，一式『蝠笑森森』飄忽至極，輕易地避開攻勢。\n",
        "$n手足未抬，心動身動，一式『火雷赫赫』忽然橫地竄出數尺，迅速地閃出戰圈。\n",
        "$n身形連連微晃，一式『蝠舞飄飄』看似無意，實則巧妙地避開了$N這一招。\n",
    });
}
